PICdew/MCU_PIC18_CODE/PIC18_G_Sensor_Demo/main.c
/** I N C L U D E S **********************************************************/

#include "GenericTypeDefs.h"
#include "Compiler.h"
#include "timers.h"
#include "delays.h"
#include "USB/usb_config.h"
#include "USB/usb_device.h"
#include "USB/usb.h"
#include "./mylib/HW_DEFINITION.h"
#include "./mylib/DATA_TRANSFER.h"
#include "./mylib/FW_CMD_PARSER_KAI.h"

/** V A R I A B L E S ********************************************************/
#if defined(__18CXX)
    #pragma udata
#endif
/***G L O B E L V A R I A B L E***********************************************/
const rom far char* ROM_STR_CODE_TYPE[] = {
	(const rom far char*) "D03/8\n",   //6
	(const rom far char*) "D05/6/7\n", //8
	(const rom far char*) "D10\n"      //4
};
const rom far char* ROM_STR_CR = (const rom far char*) "\r";
const rom far char* ROM_STR_NL = (const rom far char*) "\n";
const rom far char* ROM_STR_COMMA = (const rom far char*) ",";
const rom far char* ROM_STR_DATA_FORMAT = (const rom far char*) "%02X";

union{
	struct{
		unsigned int i2cSlaveAddr;
		unsigned int i2cBaudRate_kHz;
		unsigned int txyzDataByteLen;
		unsigned int xyzDataStartAddr;
		unsigned int txyzDataStartAddr;	
		unsigned int dataEndianness;
		unsigned int xyzDataExtraByte;
		unsigned int txyzDataExtraByte;
		unsigned int dataAlignment;
		unsigned int tFirst;
		unsigned int sspm;
		unsigned int pr2;
		unsigned int ifs;
		unsigned int commandPort;
		unsigned int monitorPort;
	};
	unsigned int v[15];
} mConfig = {
	DEFAULT_I2C_SLAVE_ADDR,
	100L*DEFAULT_I2C_BAUD_RATE_100KHZ,
	DEFAULT_TXYZ_DATA_BYTE_LEN,
	DEFAULT_XYZ_DATA_START_ADDR,
	DEFAULT_TXYZ_DATA_START_ADDR,
	DEFAULT_DATA_ENDIANNESS,
	DEFAULT_XYZ_EXTRA_BYTE,
	DEFAULT_TXYZ_EXTRA_BYTE,
	DEFAULT_DATA_ALIGNMENT,
	DEFAULT_T_FIRST,
	DEFAULT_SSPM,
	DEFAULT_PR2,
	DEFAULT_IFS,
	DEFAULT_CMD,
	DEFAULT_MON	};

unsigned char led_flag = 0, RxFlag = 0, led_blink_status_flag = 0;
unsigned char xyz_output_time_count = 0, periodXYZoutFlag = 0, dataReadyFlag = 0, T_outFlag = 0;
unsigned char monitorINT1Flag = 0, monitorINT2Flag = 0;
unsigned char ASIC_TYPE;
unsigned char sw2_pressed_flag = 0, sw2_long_pressed_flag=0, sw2_short_pressed_flag=0;//2013_0114 added by York
unsigned short int sw2_counter = 0, sw2_long_pressed_count = 0;
char USB_In_Buffer[64];
char USB_Out_Buffer[64];

BOOL stringPrinted;
volatile BOOL buttonPressed;
volatile BYTE buttonCount;

/** P R I V A T E  P R O T O T Y P E S ***************************************/
static void InitializeSystem(void);
void USBDeviceTasks(void);
void YourHighPriorityISRCode();
void YourLowPriorityISRCode();
void USBCBSendResume(void);
void BlinkUSBStatus(void);
void UserInit(void);
unsigned char ProcessIO(unsigned char*);
void DEMO_C802(unsigned char, unsigned char*);
void DEMO_C803(unsigned char, unsigned char*);
void DEMO_D10(unsigned char, unsigned char*);
void mFreqT0cki(long*);
void EraseUserFlash(void);
void WriteUserFlash(void);
void ReadAsicType(void);
void sw2_push_check(void);
void sw2_function(void);
/** VECTOR REMAPPING ***********************************************/
#if defined(__18CXX)
	//On PIC18 devices, addresses 0x00, 0x08, and 0x18 are used for
	//the reset, high priority interrupt, and low priority interrupt
	//vectors.  However, the current Microchip USB bootloader 
	//examples are intended to occupy addresses 0x00-0x7FF or
	//0x00-0xFFF depending on which bootloader is used.  Therefore,
	//the bootloader code remaps these vectors to new locations
	//as indicated below.  This remapping is only necessary if you
	//wish to program the hex file generated from this project with
	//the USB bootloader.  If no bootloader is used, edit the
	//usb_config.h file and comment out the following defines:
	//#define PROGRAMMABLE_WITH_USB_HID_BOOTLOADER
	//#define PROGRAMMABLE_WITH_USB_LEGACY_CUSTOM_CLASS_BOOTLOADER
	
	#if defined(PROGRAMMABLE_WITH_USB_HID_BOOTLOADER)
		#define REMAPPED_RESET_VECTOR_ADDRESS			0x1000
		#define REMAPPED_HIGH_INTERRUPT_VECTOR_ADDRESS	0x1008
		#define REMAPPED_LOW_INTERRUPT_VECTOR_ADDRESS	0x1018
	#elif defined(PROGRAMMABLE_WITH_USB_MCHPUSB_BOOTLOADER)	
		#define REMAPPED_RESET_VECTOR_ADDRESS			0x800
		#define REMAPPED_HIGH_INTERRUPT_VECTOR_ADDRESS	0x808
		#define REMAPPED_LOW_INTERRUPT_VECTOR_ADDRESS	0x818
	#else	
		#define REMAPPED_RESET_VECTOR_ADDRESS			0x00
		#define REMAPPED_HIGH_INTERRUPT_VECTOR_ADDRESS	0x08
		#define REMAPPED_LOW_INTERRUPT_VECTOR_ADDRESS	0x18
	#endif
	
	#if defined(PROGRAMMABLE_WITH_USB_HID_BOOTLOADER)||defined(PROGRAMMABLE_WITH_USB_MCHPUSB_BOOTLOADER)
	extern void _startup (void);        // See c018i.c in your C18 compiler dir
	#pragma code REMAPPED_RESET_VECTOR = REMAPPED_RESET_VECTOR_ADDRESS
	void _reset (void)
	{
	    _asm goto _startup _endasm
	}
	#endif
	#pragma code REMAPPED_HIGH_INTERRUPT_VECTOR = REMAPPED_HIGH_INTERRUPT_VECTOR_ADDRESS
	void Remapped_High_ISR (void)
	{
	     _asm goto YourHighPriorityISRCode _endasm
	}
	#pragma code REMAPPED_LOW_INTERRUPT_VECTOR = REMAPPED_LOW_INTERRUPT_VECTOR_ADDRESS
	void Remapped_Low_ISR (void)
	{
	     _asm goto YourLowPriorityISRCode _endasm
	}
	
	#if defined(PROGRAMMABLE_WITH_USB_HID_BOOTLOADER)||defined(PROGRAMMABLE_WITH_USB_MCHPUSB_BOOTLOADER)
	//Note: If this project is built while one of the bootloaders has
	//been defined, but then the output hex file is not programmed with
	//the bootloader, addresses 0x08 and 0x18 would end up programmed with 0xFFFF.
	//As a result, if an actual interrupt was enabled and occured, the PC would jump
	//to 0x08 (or 0x18) and would begin executing "0xFFFF" (unprogrammed space).  This
	//executes as nop instructions, but the PC would eventually reach the REMAPPED_RESET_VECTOR_ADDRESS
	//(0x1000 or 0x800, depending upon bootloader), and would execute the "goto _startup".  This
	//would effective reset the application.
	
	//To fix this situation, we should always deliberately place a 
	//"goto REMAPPED_HIGH_INTERRUPT_VECTOR_ADDRESS" at address 0x08, and a
	//"goto REMAPPED_LOW_INTERRUPT_VECTOR_ADDRESS" at address 0x18.  When the output
	//hex file of this project is programmed with the bootloader, these sections do not
	//get bootloaded (as they overlap the bootloader space).  If the output hex file is not
	//programmed using the bootloader, then the below goto instructions do get programmed,
	//and the hex file still works like normal.  The below section is only required to fix this
	//scenario.
	#pragma code HIGH_INTERRUPT_VECTOR = 0x08
	void High_ISR (void)
	{
	     _asm goto REMAPPED_HIGH_INTERRUPT_VECTOR_ADDRESS _endasm
	}
	#pragma code LOW_INTERRUPT_VECTOR = 0x18
	void Low_ISR (void)
	{
	     _asm goto REMAPPED_LOW_INTERRUPT_VECTOR_ADDRESS _endasm
	}
	#endif	//end of "#if defined(PROGRAMMABLE_WITH_USB_HID_BOOTLOADER)||defined(PROGRAMMABLE_WITH_USB_LEGACY_CUSTOM_CLASS_BOOTLOADER)"

	#pragma code
	
	
