PICdew/MCU_PIC18_CODE/PIC18_G_Sensor_Demo/main.c
	//These are your actual interrupt handling routines.
	#pragma interrupt YourHighPriorityISRCode
	void YourHighPriorityISRCode()
	{
	static unsigned int led_cnt = 0;	//delay counter
	static unsigned int periodXYZ_cnt = 0; //period output XYZ counter

		if(PIR3bits.TMR4IF == 1){
		PIR3bits.TMR4IF = 0; //clear interrupt flag
/*
2013_0113 added by York
*/
		sw2_counter = sw2_counter+sw2_pressed_flag;
		sw2_long_pressed_count = sw2_long_pressed_count+sw2_long_pressed_flag;
// 2013_0111 added end here.
		//periodic XYZ output
		if(periodXYZoutFlag == 1 && ++periodXYZ_cnt >= xyz_output_time_count){
			periodXYZ_cnt = 0;		// reset counter
			dataReadyFlag = 1;	// raise the flag
			}
		}
	
		if(INTCON3bits.INT1F == 1){//INT1
			INTCON3bits.INT1F = 0; //clear the interrupt flag
			dataReadyFlag = monitorINT1Flag; //raise the flag only when requested
		}
		if(INTCON3bits.INT2F == 1){ //INT2
			INTCON3bits.INT2F = 0; //clear the interrupt flag
			dataReadyFlag = monitorINT2Flag; //raise the flag only when requested	
		}

  		#if defined(USB_INTERRUPT)
	  	  USBDeviceTasks();
  	 	#endif

}	//This return will be a "retfie fast", since this is in a #pragma interrupt section 

	#pragma interruptlow YourLowPriorityISRCode
	void YourLowPriorityISRCode()
	{
		//Check which interrupt flag caused the interrupt.
		//Service the interrupt
		//Clear the interrupt flag
		//Etc.
	
	}	//This return will be a "retfie", since this is in a #pragma interruptlow section 
#endif

/** DECLARATIONS ***************************************************/
#pragma code
/******************************************************************************
 * Function:        void main(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Main program entry point.
 *
 * Note:            None
 *****************************************************************************/
#if defined(__18CXX)
void main(void)
#else
int main(void)
#endif
{   
	unsigned char param[64];
	unsigned char cmd_parser;
	char lock;
	ReadAsicType(); //To read the ASIC revision from flash memory. It will be 0xFF if the flash memory has been erased. 2013_0104 by York
	switch(ASIC_TYPE) //special cases ONLY
	{
		// For the function of erase flash memory.
		case 0xFF: 	ASIC_TYPE = 0x07;
		break;
		//For the device to use SPI interface only.
		case 0x08: mConfig.ifs = INTERFACE_SPI;
		break;
		default:
		break;
	}
	InitializeSystem();
	cmd_parser = 0;
	LATD = ASIC_TYPE;// To show the device to LED
    while(1)
    {
		cmd_parser = ProcessIO(param);
		if (ASIC_TYPE == 0x07)
		{
			DEMO_C803(cmd_parser, param);
		} else if (ASIC_TYPE == 0x08)
		{
			DEMO_C802(cmd_parser, param);
		} else if (ASIC_TYPE == 0x0A)
		{
			DEMO_D10(cmd_parser, param);
		}
        #if defined(USB_INTERRUPT)
            if(USB_BUS_SENSE && (USBGetDeviceState() == DETACHED_STATE))
            {
                USBDeviceAttach();
            }
        #endif
		sw2_function();//2013_0114 added by York
		// Application-specific tasks.
		// Application related code may be added here, or in the ProcessIO() function.    
    }//end while
}//end main
/*******************************************************************/
unsigned char ProcessIO(unsigned char* param)
{   
    BYTE numBytesRead;
	BYTE i;
	unsigned char Command;
	Command = 0;
    //Blink the LEDs according to the USB device status
	BlinkUSBStatus();
    // User Application USB tasks
    if((USBDeviceState < CONFIGURED_STATE)||(USBSuspendControl==1)) return 0;

    if(USBUSARTIsTxTrfReady())
    {
		numBytesRead = getsUSBUSART(USB_Out_Buffer,20);
		if(numBytesRead != 0)
		{
			periodXYZoutFlag = 0; //stop the periodic XYZout monitoring
			T_outFlag = 0; //reset the Tout flag
			dataReadyFlag = 0; //reset the flag
			monitorINT1Flag = 0;  //stop monitor INT
			monitorINT2Flag = 0;  //stop monitor INT
			INTCON3bits.INT1E = 0;  //disable INT1
			INTCON3bits.INT2E = 0; //disable INT2
			USB_Out_Buffer[numBytesRead - 1] = '\0';
			Command = parseCommand(USB_Out_Buffer, param);
			RxFlag = 1;
		}
	}
    CDCTxService();
	return(Command);
}		//end ProcessIO

/*******************************************************************/
void DEMO_C803(unsigned char Command, unsigned char * param){
	unsigned char SlaveAddr;
	char i;
	SlaveAddr = 0x38;
	if(RxFlag == 1)
	{
	switch(Command)
	{
		case 1://q,fw
		{
			strcpypgm2ram(USB_In_Buffer,ROM_STR_CODE_TYPE[1]);
			putUSBUSART(USB_In_Buffer,8);
		}
		break;
		case 4: //r,dd
		{
			I2C_Read(SlaveAddr,param[0], USB_In_Buffer, 1);
			putUSBUSART(USB_In_Buffer,1);
		}
		break;
		case 5: //r,dd,n
		{
			I2C_Read(SlaveAddr,param[0], USB_In_Buffer, param[1]);
			putUSBUSART(USB_In_Buffer,param[1]);
		}
		break;
		case 6:	
			if(param[0] <= 0 || param[0] > 100){ //not support freq range
				periodXYZoutFlag = 0; //turn off the periodic output flag
			}
			else{ //turn on the periodic output flag
				periodXYZoutFlag = 1;
					//xyz_output_time_count = 400/param[0]; //every count = 250us
				xyz_output_time_count = 100/param[0]; //every count = 1ms					
			}
		break;
		case 7: //w,dd,nn,mm
		{
			I2C_Read(SlaveAddr,param[0], USB_In_Buffer, 1);
			USB_In_Buffer[1] = (USB_In_Buffer[0] & ~param[2]) | (param[1] & param[2]);
			I2C_Write(SlaveAddr,param[0],&USB_In_Buffer[1] , 1);
		}
		break;
		case 9: //0,ddd,n
		{
			G_SENSOR_OTP_ENABLE_ON;
			i = 10;
			while(i--);
			I2C_Read(SlaveAddr,param[1], USB_In_Buffer, param[2]);
			G_SENSOR_OTP_ENABLE_OFF;
			putUSBUSART(USB_In_Buffer, param[2]);
		}
		break;
		case 10:
		{
			if( param[0] == 1){
				TRISBbits.TRISB1 = 1;  //enable interrupt on change
				INTCON2bits.INTEDG1 = 1;
				INTCON3bits.INT1E = 1;  //enable eht INT external interrupt

				//start monitor INT
	  			monitorINT1Flag = 1;
			}
			else if( param[0] == 2){
			}
				TRISBbits.TRISB2 = 1;  //enable interrupt on change
				INTCON2bits.INTEDG2 = 1;
				INTCON3bits.INT2E = 1;  //enable eht INT external interrupt

	  			monitorINT2Flag = 1;
			}
		break;
		case 11: //ow,ddd,bb
		{
			G_SENSOR_OTP_ENABLE_ON;
			i = 10;
			while(i--);
			I2C_Write(SlaveAddr,param[1], param[2], 1);
			G_SENSOR_OTP_ENABLE_OFF;
		}
		break;
		case 12: //r,xyzT
		{
			if(param[0] <= 0 || param[0] > 100){
				periodXYZoutFlag = 0;
			} else {
				periodXYZoutFlag = 1;
				xyz_output_time_count = 100/param[0];	
			}
			T_outFlag = 1;
		}
		break;
		case 13: //AutoNil
		{
			INTCONbits.GIE = 0;
			Command = AZ_SCALE_FACTOR * param[0];
			G_SENSOR_AZ_PIN_ON;
			for(i = 0; i < Command; i--){}
			G_SENSOR_AZ_PIN_OFF;
			INTCONbits.GIE = 1; // 2013_0107 added by Kuan. Bug fixed.
		}
		break;
		case 16: //change device
		{
			ASIC_TYPE = 0x08;
			LATD = ASIC_TYPE;
			INTCON3bits.INT1E = 0;  
			INTCON3bits.INT2E = 0;
	  		monitorINT1Flag = 0;
	  		monitorINT2Flag = 0;
			dataReadyFlag = 0;
			EraseUserFlash();
			WriteUserFlash();
			SPI_Init();
		}
		default:
		break;
	}
	RxFlag = 0;
	}
	if(dataReadyFlag){ //suspend once RxFlag is set //if(sendXYZoutFlag){
		USB_In_Buffer[0] = 0xFF;
		USB_In_Buffer[1] = 0xFF;
		LATD = 0x00;
		if(T_outFlag)
		{
			I2C_Read(SlaveAddr,0x40, &USB_In_Buffer[2], 4);
			putUSBUSART(USB_In_Buffer,6);
		} else {
			I2C_Read(SlaveAddr,0x41, &USB_In_Buffer[2], 3);
			putUSBUSART(USB_In_Buffer,5);
		}
		dataReadyFlag = 0;
		LATD = 0x01;
	}
}
/*******************************************************************/
void DEMO_C802(unsigned char Command, unsigned char * param){
	unsigned short regAddr;
	char i;
	regAddr = 0x0000;
	if(RxFlag == 1)
	{
	switch(Command)
	{
		case 1://q,fw
		{
			#if defined (DEBUG_COMMAND)
			LATD = 1;
			#endif
			strcpypgm2ram(USB_In_Buffer,ROM_STR_CODE_TYPE[0]);
			putUSBUSART(USB_In_Buffer,6);
		}
		break;
		case 2: //standby
			#if defined (DEBUG_COMMAND)
			LATD = 2;
			#endif
			G_SENSOR_CE_OFF;
		break;
		case 3: //normal
			#if defined (DEBUG_COMMAND)
			LATD = 3;
			#endif
			G_SENSOR_CE_ON;
		break;
		case 4: //r,dd
		{
			#if defined (DEBUG_COMMAND)
			LATD = 4;
			#endif
			regAddr |= param[0];
			SPI_Read(regAddr, USB_In_Buffer, 1);
			putUSBUSART(USB_In_Buffer,1);
		}
		break;
		case 5: //r,dd,n
		{
			#if defined (DEBUG_COMMAND)
			LATD = 5;
			#endif
			regAddr |= param[0];
			SPI_Read(regAddr, USB_In_Buffer, param[1]);
			putUSBUSART(USB_In_Buffer,param[1]);
		}
		break;
		case 6:
			#if defined (DEBUG_COMMAND)
			LATD = 6;
			#endif
			if(param[0] <= 0 || param[0] > 100){ //not support freq range
				periodXYZoutFlag = 0; //turn off the periodic output flag
			}
			else{ //turn on the periodic output flag
				periodXYZoutFlag = 1;
				//xyz_output_time_count = 400/param[0]; //every count = 250us
				xyz_output_time_count = 100/param[0]; //every count = 1ms						
			}
		break;
		case 7: //w,dd,nn,mm
		{
			#if defined (DEBUG_COMMAND)
			LATD = 7;
			#endif
			regAddr |= param[0];
			SPI_Read(regAddr, USB_In_Buffer,1);
			USB_In_Buffer[1] = (USB_In_Buffer[0] & ~param[2]) | (param[1] & param[2]);
			SPI_Write(regAddr,&USB_In_Buffer[1] , 1);
		}
		break; 
		case 8: //o,ddd
		{
			#if defined (DEBUG_COMMAND)
			LATD = 8;
			#endif
			regAddr = 0x0028 | param[0];
  			regAddr <<= 8;
			regAddr |= param[1];
	 		SPI_Read(regAddr, USB_In_Buffer, 1);
			putUSBUSART(USB_In_Buffer,1);
		}
		break;
		case 9: //o,ddd,n
		{
			#if defined (DEBUG_COMMAND)
			LATD = 9;
			#endif
		  	regAddr = 0x0028 | param[0];
  			regAddr <<= 8;
			regAddr |= param[1];
	 		SPI_Read(regAddr, USB_In_Buffer, param[2]);
			putUSBUSART(USB_In_Buffer, param[2]);
		}
		break;
		case 10:
		{
			#if defined (DEBUG_COMMAND)
			LATD = 10;
			#endif
			 putUSBUSART(param[0], 1);
		}
		break;
		case 11: //ow,ddd,bb
		{
			#if defined (DEBUG_COMMAND)
			LATD = 11;
			#endif
		  	regAddr = 0x0028 | param[0];
  			regAddr <<= 8;
			regAddr |= param[1];
			SPI_Write(regAddr, param[2], 1);
		}
		break;
		case 12:
		{
			#if defined (DEBUG_COMMAND)
			LATD = 12;
			#endif
			if(param[0] <= 0 || param[0] > 100){
				periodXYZoutFlag = 0;
			} else {
				periodXYZoutFlag = 1;
				xyz_output_time_count = 100/param[0];	
			}
			T_outFlag = 1;
		}
		break; // 2013_0107 added by Kuan. Bug fixed.
		case 16:
		{
			#if defined (DEBUG_COMMAND)
			LATD = 16;
			#endif
			ASIC_TYPE = 0x0A;
			LATD = ASIC_TYPE;
			EraseUserFlash();
			WriteUserFlash();
			mConfig.ifs = INTERFACE_I2C; //update ifs for D10 demo
			I2C_Init();
		}
		default:
		break;
	}
	RxFlag = 0;
	}

