PICdew/MCU_PIC18_CODE/PIC18_G_Sensor_Demo/main.c
void ReadAsicType(void) // To read 2 bytes only from flash address 0x01F800
{
		short OriginalTBLPTR;
		OriginalTBLPTR = TBLPTR; //To save the TBLPTR before read flash by unknow reason since it will cause USB init fail.
		TBLPTR = 0x1f800;
_asm
		tblrd
_endasm
		TBLPTR = OriginalTBLPTR;
		ASIC_TYPE = TABLAT;
}
/*******************************************************************
 * Function:        Push button #2 check.
 *         
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          sw2_long_pressed_flag, sw2_short_pressed_flag
 *
 * Side Effects:    None
 *
 * Overview:        
 *
 * Note:            The sw2_long_pressed_flag and sw2_short_pressed_flag will be set to "1" once the sw2 is pressed over 100ms.
 *                  if sw2 is pressed over 100ms and less than 1000ms then sw2_short_pressed_flag = 1
 *                  if sw2 is pressed over 1000ms then sw2_long_pressed_flag = 1
 *                  The function uses Timer4 for 1ms counter.
 *                  2013_0114 added by York
 *******************************************************************/
void sw2_push_check(void)
{
	if (!sw2)   //sw2_counter = sw2_counter+sw2_pressed_flag every 1ms
	{
		if (sw2_counter >= 1000) 
		{
		sw2_long_pressed_flag = 1;
		sw2_pressed_flag=0;//To stop count up sw2_counter.
		}
		else 
		sw2_pressed_flag=1;//To count up sw2_counter.
	}
	else 
	{
		if (sw2_counter>=100 && sw2_counter <1000)sw2_short_pressed_flag = 1;
		sw2_counter=0;
		sw2_pressed_flag=0;
	}
}
/*******************************************************************
 * Function:        Push button #2 function.
 *         
 *
 * PreCondition:    None
 *
 * Input:           sw2_long_pressed_flag, sw2_short_pressed_flag
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        
 *
 * Note:            ASIC type will be changed if sw2 is pressed by 1000ms.
 *                  After release sw2 button from 1000ms pressed then short 
 *                  press sw2 to switch the ASIC type in 5000ms.
 *                  2013_0115 added by York
 *******************************************************************/
void sw2_function(void)
{
static WORD sw2_function_count=0;
static char sw2_function_flag=0;
static char asic_type_changed_flag=0;
sw2_push_check();
	if (sw2_long_pressed_flag) //To switch the ASIC TYPE with sw2 short pressed.
	{
		if (sw2_function_count==0)//Blink the LED of ASIC TYPE.
		{
		sw2_function_count=5000U;
		sw2_function_flag=!sw2_function_flag;
			if (sw2_function_flag) LATD=ASIC_TYPE;
			else LATD=0x00;
		}
		sw2_function_count--;//Blink LED of ASIC here.
		if (sw2_long_pressed_count >= 5000) // After 5000ms then finish the ASIC TYPE switch function.
		{
		sw2_long_pressed_flag = 0;
		sw2_long_pressed_count = 0;
			if (asic_type_changed_flag)//If ASIC TYPE has been changed then update flash memory.
			{
			EraseUserFlash();
			WriteUserFlash();
			}
		LATD=ASIC_TYPE;
		}
	}	
	if (sw2_short_pressed_flag) 
	{
		if (sw2_long_pressed_flag)//ASIC TYPE changes here if sw2 has been long pressed.
		{
		sw2_long_pressed_count=0;
		switch(ASIC_TYPE)
			{
			case 0x07:
			ASIC_TYPE = 0x08;
			INTCON3bits.INT1E = 0;  
			INTCON3bits.INT2E = 0;
	  		monitorINT1Flag = 0;
	  		monitorINT2Flag = 0;
			dataReadyFlag = 0;
			SPI_Init();
			break;
			case 0x08:
			ASIC_TYPE = 0x0A;
			mConfig.ifs = INTERFACE_I2C; //update ifs for D10 demo
			I2C_Init();
			break;
			case 0x0A:
			ASIC_TYPE = 0x07;
   			INTCON3bits.INT1E = 0;  
   			INTCON3bits.INT2E = 0;
   			monitorINT1Flag = 0;
   			monitorINT2Flag = 0;
   			dataReadyFlag = 0;
			I2C_Init();
			break;
			default:
			break;
			}
		asic_type_changed_flag = 1;
		}
		else asic_type_changed_flag = 0;
	sw2_short_pressed_flag = 0;
	}
}
/** EOF main.c *************************************************/

